# Даны 2 массива, отсортированные по неубыванию, а также число k. Нужно
# определить пары, которые имеют наименьшую сумму. При этом пара должна
# состоять из одного элемента первого массива, и одного элемента второго.
# Нужно найти k таких пар с наименьшей суммой.
#
# Формат ввода
# В первой строке записано число n1 - длина первого массива.
# Во второй строке через пробел записаны числа первого массива.
# Далее записано число n2 - длина втрого массива.
# В четвертой строке через пробел записаны числа второго массива.
# В последней строке записано число k.
# n1 и n2 не превосходят 1000, числа в массивах не превосходят 3000.
# k не превосходит число возможных пар.
#
# Формат вывода
# Нужно вывести получившиеся пары в отсортированном порядке, каждую через
# пробел в отдельной строке. Числа внутри пары также должны быть отсортированы.
# Общая сортировка выполняется для уже отсортированных пар.
#
# Примечания
# Если на границу k попадают значения с одинаковой суммой, нужно выводить пару,
# соответствующую элементу, который имеет меньший индекс с первом массиве.


