# Задание по программированию: Длина последовательности
number = 1
i = -1
while number > 0:
    number = int(input())
    i += 1
print(i)
